<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [1]:
# Loading the key libraries and packages
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Loading the dataset
df = pd.read_csv("FoodBalanceSheets_E_Africa_NOFLAG.csv", encoding = "latin-1")
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [3]:
# Select columns ‘Y2017’ and ‘Area’
area_x_2017 = df[["Y2017", "Area"]]
area_x_2017.head()

      Y2017     Area
0  41389.00  Algeria
1      0.00  Algeria
2   3341.00  Algeria
3     92.82  Algeria
4     80.19  Algeria

In [4]:
# Perform a groupby operation on ‘Area’. Which of these Areas had the highest sum in 2017?
area_x_2017.groupby(by = "Area").sum().reset_index().sort_values(by = "Y2017", ascending= False).head()

            Area       Y2017
34       Nigeria  1483268.23
13         Egypt   866379.92
40  South Africa   517590.54
15      Ethiopia   448683.76
30       Morocco   388495.36

In [5]:
# Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?
element_wise = df.groupby(by = "Element").sum().reset_index()
element_wise.loc[element_wise["Element"] == "Stock Variation"]

,Element,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
15,Stock Variation,571566,11329527,21464704,58749.83,34910.99,33140.12,54316.91,20577.91

In [6]:
# Which year had the least correlation with ‘Element Code’?
df.corr()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
Area Code,1.000000,-0.005159,-0.000209,0.006164,0.005472,0.005247,0.005006,0.005665
Item Code,-0.005159,1.000000,-0.024683,0.021722,0.020857,0.020109,0.021494,0.021314
Element Code,-0.000209,-0.024683,1.000000,0.024457,0.023889,0.023444,0.024254,0.024279
Y2014,0.006164,0.021722,0.024457,1.000000,0.994647,0.996081,0.995230,0.994872
Y2015,0.005472,0.020857,0.023889,0.994647,1.000000,0.995739,0.988048,0.988208
Y2016,0.005247,0.020109,0.023444,0.996081,0.995739,1.000000,0.992785,0.992757
Y2017,0.005006,0.021494,0.024254,0.995230,0.988048,0.992785,1.000000,0.998103
Y2018,0.005665,0.021314,0.024279,0.994872,0.988208,0.992757,0.998103,1.000000

In [7]:
# Question 8
y = [(2, 4), (7, 8), (1, 5, 9)]
y[1][1]

8

In [8]:
# What is the total Protein supply quantity in Madagascar in 2015?
madagascar_protein = df.loc[df["Area"] == "Madagascar"]
madagascar_protein = madagascar_protein.loc[madagascar_protein["Element"].str.contains("Protein supply")]
madagascar_protein.reset_index(drop = True, inplace = True)
madagascar_protein["Y2015"].sum()

173.04999999999998

In [9]:
# How would you check for the number of rows and columns in a pandas DataFrame named df?
df.shape

(60943, 12)

In [10]:
# Given the following python code, what would the output of the code give?
my_tuppy = (1,2,5,8)
my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

In [11]:
# Select columns ‘Y2017’ and ‘Area’
area_2017 = df[["Area", "Y2017"]]

# Perform a groupby operation on ‘Area’.  Which of these Areas had the 7th lowest sum in 2017?
area_2017.groupby(by = "Area").sum().sort_values(by = "Y2017", ascending = False).tail(10)

                          Y2017
Area
Djibouti               22729.91
Botswana               22101.30
Lesotho                21267.96
Guinea-Bissau          19102.77
Cabo Verde             14650.74
Sao Tome and Principe  12662.63
Seychelles               442.34
Comoros                   59.84
Sudan (former)             0.00
Ethiopia PDR               0.00

In [12]:
# What is the total sum of Wine produced in 2015 and 2018 respectively?
wine = df.groupby(by = "Item").sum().reset_index()
wine.loc[wine["Item"] == "Wine"]

,Item,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
117,Wine,66206,1319535,1818328,4497.36,4251.81,3872.09,4178.02,4039.32

In [13]:
# Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?
processing = df.groupby(by = "Element").sum().reset_index()
processing.loc[processing["Element"] == "Processing"]

,Element,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
10,Processing,271940,5350416,10313310,282923.0,287929.0,280631.0,292836.0,308429.0

In [14]:
# What is the total number of unique countries in the dataset?
df.nunique()

Area Code         49
Area              49
Item Code        122
Item             119
Element Code      18
Element           18
Unit               5
Y2014           4493
Y2015           4520
Y2016           4520
Y2017           4537
Y2018           4591
dtype: int64

In [15]:
# What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?
df[["Y2017"]].describe()

               Y2017
count   59437.000000
mean      140.917765
std      1671.862359
min     -1582.000000
25%         0.000000
50%         0.100000
75%         9.000000
max    190873.000000

In [16]:
# What would be the output for?
S = [['him', 'sell'], [90, 28, 43]]
S[0][1][1]

'e'

In [17]:
# What is the total number and percentage of missing data in 2014 to 3 decimal places?
missing_value_count = df[["Y2014"]].isnull().sum()
print(missing_value_count)

missing_value_percent = (missing_value_count/len(df[["Y2014"]]))*100
print(missing_value_percent)

Y2014    1589
dtype: int64
Y2014    2.607354
dtype: float64

In [18]:
# How do you create a pandas DataFrame using these lists
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]
col = ["Age","Nationality","Overall"]

# Option 1
z = pd.DataFrame(lst, columns = col, index = [1,2,3])
z

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [19]:
# Option 2
k = pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])
k

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92